[
  {
    "name": "Save The Girl!",
    "version": "1.0.5",
    "genres": "Games, Casual, Puzzle, Entertainment",
    "imageUrl": "https://is5-ssl.mzstatic.com/image/thumb/Purple113/v4/56/0f/26/560f269c-7a63-b3cb-67be-fa33e189b545/source/512x512bb.jpg",
    "ratings": [
      2637,
      1387,
      2679,
      4033,
      31353
    ],
    "reviews": [
      {
        "rating": 2,
        "name": "🔥NuculearNailah🔥",
        "message": "I love the game but I hate the ads! There’s just to many like when one ad comes 30 seconds later there’s another!",
        "version": "1.0.5",
        "title": "Ads"
      },
      {
        "rating": 1,
        "name": "vixonx",
        "message": "I never have an issue with ads, I totally understand that game developers need ads for income, etc., but with this app and it’s game “complexity”, it has way too many ads. \nAnytime you mess up, ad, anytime you start a level, ad. It does not need ad after ad after ad. It’s very annoying for very short levels. I would rate it 4 if it didn’t bombard you with ads anytime you moved on or had to redo.",
        "version": "1.0.5",
        "title": "Way too many ads"
      },
      {
        "rating": 1,
        "name": "jidwiyu",
        "message": "Super annoying",
        "version": "1.0.5",
        "title": "More ads than game time"
      },
      {
        "rating": 3,
        "name": "TheFlippyGamer",
        "message": "So first off, I like the game a little because it don’t lie & it’s fun. BUT, I went ALLL the way to level 72 , & then it just randomly took me all the way back to level 11 for NO reason. I am VERY disappointed. I worked very hard to get up to that level, and it happened for no reason and I didn’t click ANYTHING. & there’s a LOT of ads. But other than that, it’s fun & if your looking for fun you should play it but at the same time ion kno because it took me ALL the way back. Zombie walking.",
        "version": "1.0.5",
        "title": "I like it a little"
      },
      {
        "rating": 1,
        "name": "ihateadssssss0576",
        "message": "To many ads",
        "version": "1.0.5",
        "title": "Ads ads ads"
      }
    ]
  },
  {
    "name": "Join Clash",
    "version": "2.6",
    "genres": "Games, Entertainment, Action, Casual",
    "imageUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple123/v4/fa/d0/12/fad0125f-6b2d-9507-15f0-11f235c7f72a/source/512x512bb.jpg",
    "ratings": [
      1246,
      584,
      1517,
      2593,
      24694
    ],
    "reviews": [
      {
        "rating": 1,
        "name": "I don't like this games",
        "message": "Too many ads. Do not download it",
        "version": "2.6",
        "title": "Too many ads"
      },
      {
        "rating": 1,
        "name": "freekuhhleek",
        "message": "Don’t get it. You’ll spend more time watching ads than playing. Cool game, terribly money hungry. Uninstalled after 5 minutes probably didn’t get 30 seconds of gameplay.",
        "version": "2.6",
        "title": "5 Seconds of Gameplay for 30 Seconds of Ads"
      },
      {
        "rating": 1,
        "name": "Spoopy sklletons",
        "message": "Deleted after the 1st 5min because of all the ads. Cool game concept, but I don’t feel like sitting thru an ad after each level because the “no thanks” button for doubling coins is placed in such a way that 9/10 you’ll  hit the ad above or below it.",
        "version": "2.6",
        "title": "Don’t download"
      },
      {
        "rating": 1,
        "name": "D_WangDO",
        "message": "Wow, spend three times more watching ads than actually playing a game. Obstacle takes less than 10 seconds and then you watch a 60 second ad. Horrible.",
        "version": "2.6",
        "title": "Advertisement HELL"
      },
      {
        "rating": 1,
        "name": "ShortyCheri",
        "message": "More ads than game play. Don’t even waste your time getting this game.",
        "version": "2.6",
        "title": "Way too many ads"
      }
    ]
  },
  {
    "name": "Fishdom",
    "version": "4.7.5",
    "genres": "Games, Simulation, Puzzle, Entertainment",
    "imageUrl": "https://is3-ssl.mzstatic.com/image/thumb/Purple123/v4/3f/30/0a/3f300ab7-f53d-3e49-737c-e8c49336c948/source/512x512bb.jpg",
    "ratings": [
      11424,
      5431,
      17992,
      58977,
      348619
    ],
    "reviews": [
      {
        "rating": 5,
        "name": "RadinsMom",
        "message": "I love playing Fishdom.   I enjoy feeding the fish and seeing my older tanks. Please add more varieties of fancy goldfish.  I would also like to feed the fish in my older tanks or designate my favorite tank up front to feed the fish in tht one",
        "version": "4.7.5",
        "title": "Goldfish please"
      },
      {
        "rating": 1,
        "name": "MsNancy",
        "message": "I wanted to like this game, as it was advertised in their commercials as a cool puzzle (non-Tetris style) game; however it ended up being more like candy crush, except the goal you needed to achieve quickly became impossible. Just wasn’t at all the cool puzzle game they advertised in their video ads that appeared during play in other games. Just deleted it.",
        "version": "4.7.5",
        "title": "Got boring real quick- not as advertised"
      },
      {
        "rating": 3,
        "name": "S0CCERM0M",
        "message": "I really like this game. However, I only gave it 3 stars because the ads that I watched to encourage me to download the game were not the same as the game. So the star rating is for false advertising but h the game itself is fun so far.",
        "version": "4.7.5",
        "title": "Deceived"
      },
      {
        "rating": 5,
        "name": "InfamousDubb",
        "message": "I really like the challenges they have but I wish that when I win the challenge I can select when to redeem the rewards. For example I will log in to play during my lunch time and find out I won 3 hours of free time but don’t have 3 hours to play. \nOther than that I really love this game!",
        "version": "4.7.5",
        "title": "Love love love BUT"
      },
      {
        "rating": 5,
        "name": "Ken is the diva",
        "message": "i play this game everyday",
        "version": "4.7.5",
        "title": "love this game!"
      }
    ]
  },
  {
    "name": "Wheel Smash",
    "version": "1.8.1",
    "genres": "Games, Simulation, Casual",
    "imageUrl": "https://is2-ssl.mzstatic.com/image/thumb/Purple123/v4/ae/13/d3/ae13d3ca-e9ef-6a38-f0ed-e0ffcc06ecac/source/512x512bb.jpg",
    "ratings": [
      1104,
      732,
      1568,
      3600,
      30710
    ],
    "reviews": [
      {
        "rating": 2,
        "name": "LoonPrune",
        "message": "Good game but for everyone’s sake take the ads off!",
        "version": "1.8.1",
        "title": "Take the ads off PLEASE!!!"
      },
      {
        "rating": 5,
        "name": "Audriannapanda21111",
        "message": "I love this app it is really fun and satisfying",
        "version": "1.8.1",
        "title": "I like this app"
      },
      {
        "rating": 5,
        "name": "i cant send a",
        "message": "They fix the bugs!",
        "version": "1.8.1",
        "title": "Satisfying it anyone thinks it’s.."
      },
      {
        "rating": 5,
        "name": "hzhavusnacdj",
        "message": "This game is amazing it’s also same this relaxes me a lot",
        "version": "1.8.1",
        "title": "Download it and see"
      },
      {
        "rating": 5,
        "name": "dedx-x",
        "message": "I’m so satisfied with this game 🤩🤩🤩🤩",
        "version": "1.8.1",
        "title": "Love at first play"
      }
    ]
  },
  {
    "name": "Perfect Cream",
    "version": "1.7.1",
    "genres": "Games, Casual, Action",
    "imageUrl": "https://is3-ssl.mzstatic.com/image/thumb/Purple113/v4/3d/40/c2/3d40c2fb-5a25-5160-d52f-cb0518326ff3/source/512x512bb.jpg",
    "ratings": [
      1986,
      1393,
      3248,
      6683,
      51776
    ],
    "reviews": [
      {
        "rating": 1,
        "name": "dakotaroser",
        "message": "I PAID for the app so I could enjoy it and not watch the ads but nothing has changed??? I still get an OBSURD amount of ads. Why? I need my money back but I would like if it actually worked...",
        "version": "1.7.1",
        "title": "I bought the app"
      },
      {
        "rating": 5,
        "name": "anime.godmidoriya",
        "message": "Very nice",
        "version": "1.7.1",
        "title": "Nice"
      },
      {
        "rating": 2,
        "name": "Sophia Erdmann",
        "message": "So I have been playing for about a month and I was seeing how far I could get with pressing the cream down all of the way. And, I passed the level as well! Great game but I want harder options of it.",
        "version": "1.7.1",
        "title": "Good game but to hard to loose!"
      },
      {
        "rating": 3,
        "name": "Jirafitapampisita",
        "message": "Primero que nada les quiero decir que me encanta el juego las gráficas los detalles y todo esta súper.Pero e notado que cada ves que termino una partida , entro al juego o compro algo me obligan a ver un video de cada tres minutos.No me molesta verlos pero no es nada entretenido que sean tan  corridos.Literal mente cada cosa que hago me lleva a ver un anuncio.Les recomiendo que alarguen el tiempo que salga el video.Por ejemplo de cada una hora o de cada 20 minutos ponen un anuncio. Aprovecho para decirles que Los niveles están muy fáciles debería ponerlos un poco más complicados.De lo demás no me quejo el juego esta SÚPER y disculpen la molestia.",
        "version": "1.7.1",
        "title": "Un defecto"
      },
      {
        "rating": 1,
        "name": "Lahna S",
        "message": "This game was ok until I realized how many ads (which were unskippable) popped up, after every little round there was an ad like 30 seconds long, unless you’re ok with ads I DO NOT recommend",
        "version": "1.7.1",
        "title": "Not recommended"
      }
    ]
  },
  {
    "name": "Home Restoration",
    "version": "1.02",
    "genres": "Games",
    "imageUrl": "https://is4-ssl.mzstatic.com/image/thumb/Purple123/v4/28/6a/23/286a2302-8b6f-7842-1d1a-3933f9d484e4/source/512x512bb.jpg",
    "ratings": [
      341,
      217,
      653,
      1345,
      9838
    ],
    "reviews": [
      {
        "rating": 2,
        "name": "M&M j 2019",
        "message": "This game is a disappointment because there is glitches, and it is like a 4 year old made it. The glitches are really bad and I can’t play the stupid game. You need an ad to get just about EVERYTHING and ANYTHING the point is, please do not download the app. (Huge disappointment) \n😡😭😤😔😒🚫⁉️",
        "version": "1.03",
        "title": "Just a disappointment"
      },
      {
        "rating": 5,
        "name": "Rossdaddy185",
        "message": "Amazing app",
        "version": "1.03",
        "title": "I love it"
      },
      {
        "rating": 2,
        "name": "lydia123987",
        "message": "There are simply too many ads.  The game isnt playable because of how many ads there are.  I was only able to play it a few minutes before I got tired of them. I’m not paying to remove them.",
        "version": "1.03",
        "title": "Too many ads"
      },
      {
        "rating": 2,
        "name": "seahawk1264",
        "message": "Get rid of ads and it’ll be better hate that there are ads after every step",
        "version": "1.03",
        "title": "To many ads"
      },
      {
        "rating": 1,
        "name": "Nicky Plavenia",
        "message": "I loved this game but really there are ad after ad after ad and at this point it’s very very annoying. There is an ad even after I watched an ad, and I don’t know if it’s only me or not but the ad is the same exact 30 sec ad every single time! The ad does not even change it is the same ad! That is just frustrating and just every time you even press anything there is an ad. I literally clean the floor, there’s an ad, I put a design on the floor, there’s an ad, after that ad there’s another ad just to go to the other furniture! It is very annoying and I do not have the patience to play a game that is basically watching ad more than actually even playing the game. And to warn anyone who would just buy the no ad thing, there isn’t one. At this point I just deleted the app because it was very stressful and just annoying but overall without the ads it would be a much better game.",
        "version": "1.03",
        "title": "Way way too many ads!"
      }
    ]
  },
  {
    "name": "Words With Friends 2 Word Game",
    "version": "14.21.1",
    "genres": "Games, Entertainment, Word, Board",
    "imageUrl": "https://is2-ssl.mzstatic.com/image/thumb/Purple123/v4/be/bb/af/bebbaf53-3e6e-eb90-1f99-284870e2a0e8/source/512x512bb.jpg",
    "ratings": [
      9107,
      4751,
      12843,
      69626,
      350977
    ],
    "reviews": [
      {
        "rating": 1,
        "name": "Billpayer2011",
        "message": "Make ads silent when phone settings are on silent. It’s maddening that an ad will blare at full volume when all phone setting are on “silent”. Intrusive and pushy. Please stop this practice!!!!!!!!!!!!",
        "version": "14.21.1",
        "title": "Volume!!"
      },
      {
        "rating": 1,
        "name": "Ahgdherjfjfjcf",
        "message": "What’s up with all your solo challenges? All the characters are liken to trannies, climate hoax Greta, or demons. Your Pharisee is showing. Grow a set, and quit with this freakishly weird bs. We are not club kids.. We’re adults looking for a word game, not your effeminate UN propaganda!",
        "version": "14.21.1",
        "title": "Solo challenge"
      },
      {
        "rating": 4,
        "name": "JustBeingHonestHere...",
        "message": "Great time killer and word game. Tons of ads though. And the ads take a while to close out because each has a timer countdown. App was way better before this. Now it’s just frustrating.",
        "version": "14.21.1",
        "title": "Great app"
      },
      {
        "rating": 1,
        "name": "DeAndre R.",
        "message": "I have the setting turned off that allows wordmasters to start Solo Challenges, yet the Solo Challenges still begin anyway and pop up as a notification that you CANNOT get rid of unless you turn off all notifications for the app or resign from a challenge that shouldn’t have appeared in your list of games in the first place.",
        "version": "14.21.1",
        "title": "Game ignores settings."
      },
      {
        "rating": 1,
        "name": "Constantinemagildahyde",
        "message": "This was awful.  Tried to play my wife (who I love playing scrabble with) but it was utterly unplayable.  Fake word after fake word, acronyms, slang, and just utter \"whatever sticks\" BS made it unplayable.  I deleted the app when it accepted the word SHI.",
        "version": "14.21.1",
        "title": "Not English, ruined by distracting crap"
      }
    ]
  },
  {
    "name": "Animal Crossing: Pocket Camp",
    "version": "3.1.2",
    "genres": "Games, Simulation, Family",
    "imageUrl": "https://is2-ssl.mzstatic.com/image/thumb/Purple114/v4/a5/f5/20/a5f520e7-526f-d4f5-7293-709b13ee6318/source/512x512bb.jpg",
    "ratings": [
      4202,
      1882,
      7332,
      31769,
      322257
    ],
    "reviews": [
      {
        "rating": 1,
        "name": "veeyingying",
        "message": "The app won’t load, crashes before I can even see the title screen. I have not been able to play the game even once after downloading it. I’ve tried turning my phone on and off, as well as deleting and redownloading the app",
        "version": "3.1.2",
        "title": "Crash"
      },
      {
        "rating": 5,
        "name": "simpsoon",
        "message": "I’ve never had a animal crossing game and it’s just so heartwarming and I love it",
        "version": "3.1.2",
        "title": "Why I love this"
      },
      {
        "rating": 5,
        "name": "OrangeOrangebb",
        "message": "My 5th time re-downloading this game",
        "version": "3.1.2",
        "title": "Don’t mind me"
      },
      {
        "rating": 1,
        "name": "ChaeArmy💜❤️",
        "message": "It’s good for a few days but then get boring. You can’t do anything special on there except fish,buy some items, and decorate your camp as well as collect things like shells or fruit.",
        "version": "3.1.2",
        "title": "Boring🙄🙄"
      },
      {
        "rating": 3,
        "name": "wvlfsbane",
        "message": "This is one of my favorite games i think ive ever played, i spend hours on it everyday and have a blast talking to villagers and catching bugs etc. However i would really really like to change my name. i would reset but im on level 25 and have put a lot of time, bells, and leaf tickets into my game so far and this would be really upsetting to do. i just want to change my name as the one i have entered now makes me uncomfortable to be called. if theres any way a feature can be added to change it please do so! again its a wonderful game but this one thing has put me a bit off and made me uncomfortable considering its what the villagers all call me etc. Thank you!",
        "version": "3.1.2",
        "title": "Please let us change names!"
      }
    ]
  },
  {
    "name": "UNO!™",
    "version": "1.0.33",
    "genres": "Games, Card, Family, Entertainment",
    "imageUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple114/v4/3e/4d/58/3e4d5835-ab56-206c-a246-c96986704553/source/512x512bb.jpg",
    "ratings": [
      7536,
      2206,
      4802,
      11128,
      95516
    ],
    "reviews": [
      {
        "rating": 5,
        "name": "Paoogap",
        "message": "Quiero empezar de 0 mi cuenta, la tengo vinculada con Facebook, como le hago?",
        "version": "1.0.33",
        "title": "AYUDA"
      },
      {
        "rating": 2,
        "name": "Tikinwiki",
        "message": "Are are obnoxious and play at full volume ever when you have the sound and music turned off",
        "version": "1.0.33",
        "title": "Obnoxious"
      },
      {
        "rating": 1,
        "name": "andy_0906",
        "message": "The interface is very confusing..",
        "version": "1.0.33",
        "title": "confusing interface"
      },
      {
        "rating": 2,
        "name": "Virgimar",
        "message": "Whenever you win a match and win coins in the next row the probability of lossing it is high they o that in order that you buy them and when you buy they dont charge what it is they charge more !!! Try it and you would see!! Total Dissapointment",
        "version": "1.0.33",
        "title": "They will take more money feom the card than what you bought it for warning!!!!"
      },
      {
        "rating": 5,
        "name": "Luckdragon52",
        "message": "Good",
        "version": "1.0.33",
        "title": "Good"
      }
    ]
  },
  {
    "name": "Mario Kart Tour",
    "version": "2.0.1",
    "genres": "Games, Action, Racing",
    "imageUrl": "https://is4-ssl.mzstatic.com/image/thumb/Purple113/v4/43/76/06/43760697-b60a-3d0e-0001-0301412db99b/source/512x512bb.jpg",
    "ratings": [
      24545,
      6668,
      16387,
      51555,
      724919
    ],
    "reviews": [
      {
        "rating": 3,
        "name": "DirtyDanTattMan",
        "message": "I absolutely loved this game for months, ever since it first came out. Can’t stop playing it everyday nonstop. Was getting every challenge, ever high score and ranking needed. I was having a blast with it. AND THEN you finally make multiplayer mode an option after having it on screen for months but could never play it AND ITS HORRIBLE. So many issues i don’t know where to begin. First of all, I can’t even get pass class F because I’m coming in last place after the million glitches, everyone is already done with lap 2. Anytime someone is near me, the game freaks out and just makes me crash and all other players pass me. There is WAY TOO MANY BUGS in multiplayer to even have any fun with this mode, it’s ridiculous. I haven’t even tried to play with a friend because I know something will go wrong and it won’t be fair to anyone. And finally the worst part is, I HAVE TO PLAY MULTIPLAYER MODE🤬 If there weren’t any challenges dedicated strictly to multiplayer mode then I would have no issue with it and completely ignore it until it was fixed. But for me to excel in the game and get the stars and everything I need and want, I HAVE TO PLAY IT. It’s completely unfair and hope this is resolved before I stop spending my money on this game every week or so. I never complain or write reviews but I had to say something because I’ve loved this game this it began and now it’s having a huge issue to me. Hope someone reads this and can agree with me. Rant over😤👎👎👎",
        "version": "2.0.1",
        "title": "FIX MULTIPLAYER !!!!!"
      },
      {
        "rating": 5,
        "name": "OblockJohnny",
        "message": "Great game for only thing is the Turing is to sensitive",
        "version": "2.0.1",
        "title": "Mario Kart"
      },
      {
        "rating": 1,
        "name": "ChoppedSalami",
        "message": "I have a whole iPhone 11 Pro Max and all this game does is crash . No wonder Nintendo always had the worst game systems!",
        "version": "2.0.1",
        "title": "Can’t even run it"
      },
      {
        "rating": 1,
        "name": "applefan0699",
        "message": "No landscape mode zero stars",
        "version": "2.0.1",
        "title": "No landscape"
      },
      {
        "rating": 1,
        "name": "Alijah Simon",
        "message": "Please use Game Center, what iOS users use.",
        "version": "2.0.1",
        "title": "Requires Nintendo account"
      }
    ]
  }
]